name: "ensemble"
platform: "ensemble"
max_batch_size: 1024
input [
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "max_output_len"
    data_type: TYPE_INT32
    dims: [ 1 ]
  },
  {
    name: "end_id"
    data_type: TYPE_INT32
    dims: [ 1 ]
    optional: true
  }
]
output [
    {
        name: "output_ids"
        data_type: TYPE_INT32
        dims: [ -1, -1 ]
    },
    {
        name: "output_sequence_lengths"
        data_type: TYPE_UINT32
        dims: [ -1 ]
    },
    {
        name: "input_sequence_lengths"
        data_type: TYPE_INT32
        dims: [ 1 ]
    }
]
ensemble_scheduling {
  step [
    {
      model_name: "tokenizer"
      model_version: -1
      input_map {
        key: "query"
        value: "text"
      }
      input_map {
        key: "max_output_len"
        value: "max_output_len"
      }
      output_map {
        key: "input_ids"
        value: "input_ids"
      }
      output_map {
        key: "sequence_lengths"
        value: "input_sequence_lengths"
      }
    },
    {
      model_name: "tensorrt_llm"
      model_version: -1
      input_map {
        key: "input_ids"
        value: "input_ids"
      }
      input_map {
        key: "request_output_len"
        value: "max_output_len"
      }
      input_map {
        key: "input_lengths"
        value: "input_sequence_lengths"
      }
      input_map {
        key: "end_id"
        value: "end_id"
      }
      output_map {
        key: "output_ids"
        value: "output_ids"
      }
      output_map {
        key: "sequence_length"
        value: "output_sequence_lengths"
      }
    }
  ]
}
